/*******************************************************************************
* 文件名 : main.c
* 实现功能:nrf24l01测试程序
* 版本     作者            日期            说明
* V1.0                  2016/01/05      初始版本

* 描述   : MCU: STC15f2k60s2     晶振: 22.1184   MHz
           
*******************************************************************************/
#include "NRF24L01.h" 
#include "uart.h"
 


/*******************************************************************************
* 功能描述 : 主函数
* 函数属性 : 
* 输入参数 : 
* 返回参数 : 
* 函数详解 : 
*******************************************************************************/

void main(void)
{
	//请到头文件中修改数据的宽度，以保证匹配
	uchar i = 0;
	uchar a[Rx_Data_Width] = 0;//定义用户缓冲区，接收到的数据保存于此
	
	UartInit();
	init_NRF24L01() ;
	
	UART_Send_Str("开始接收信息\r\n\r\n\r\n");
	
	
	while(1)
	{
		if(NRF24L01_RxPacket(a))
		{
			UART_Send_Str("Recive: ");
			
			for(i=0;i<3;i++)
			{
				UART_Send_Byte(a[i]); //用串口打印
			}
			//判读Tx_DS,如果模块的连接不正常，将没有串口、LED的提示
			UART_Send_Str("\r\n");
			
	   	}
	}	
}