/*
********************************************************************************
*                                嵌入式微系统
*                               msOS for Mcu51
*
*                               主芯片:MCU51
*                           深圳市雨滴科技有限公司
*
*                                作者:王绍伟
*                                网名:凤舞天
*                                标识:Wangsw
*
*                                QQ:26033613
*                               QQ群:291235815
*                        淘宝店:http://52edk.taobao.com
*                      论坛:http://gongkong.eefocus.com/bbs/
*                    Google开源:https://code.google.com/p/msos/
*                博客:http://forum.eet-cn.com/BLOG_wangsw317_1268.HTM
********************************************************************************
*文件名     : device_sensor.c
*作用       : 各种外部传感器中断输入
*原理       : 
********************************************************************************
*版本     作者            日期            说明
*V0.1    Wangsw        2013/09/29       初始版本
********************************************************************************
*/

#include "system.h"


/*******************************************************************************
* 函数名	: InitializeExternInterrupt0
* 描述	    : 初始化外部中断0
* 输入参数  : enable 布尔变量,使能外部中断；edge 布尔变量，边沿触发
* 返回参数  : 
********************************************************************************
*版本     作者            日期            说明
*V0.1    Wangsw        2013/09/29       初始版本
*******************************************************************************/
void InitializeExternInterrupt0(bool enable, bool edge)
{
    IE0 = 0;						
    IT0 = edge;
    EX0 = enable;
}

/*******************************************************************************
* 函数名	: ExternInterrupt0Handler
* 描述	    : 外部中断0处理函数
* 输入参数  : 无
* 返回参数  : 无
********************************************************************************
*版本     作者            日期            说明
*V0.1    Wangsw        2013/09/29       初始版本
*******************************************************************************/
void ExternInterrupt0Handler(void) interrupt 0
{
    //PostMessage(Int0MessageType, 0); 
    //IE0 = 0;
}

/*******************************************************************************
* 函数名	: InitializeExternInterrupt1
* 描述	    : 初始化外部中断1
* 输入参数  : enable 布尔变量,使能外部中断；edge 布尔变量，边沿触发
* 返回参数  : 
********************************************************************************
*版本     作者            日期            说明
*V0.1    Wangsw        2013/09/29       初始版本
*******************************************************************************/
void InitializeExternInterrupt1(bool enable, bool edge)
{
    IE1 = 0;						
    IT1 = edge;
    EX1 = enable;
}

/*******************************************************************************
* 函数名	: ExternInterrupt1Handler
* 描述	    : 外部中断1处理函数
* 输入参数  : 无
* 返回参数  : 无
********************************************************************************
*版本     作者            日期            说明
*V0.1    Wangsw        2013/09/29       初始版本
*******************************************************************************/
void ExternInterrupt1Handler(void) interrupt 2
{
    //PostMessage(Int1MessageType, 0);
    //IE1 = 0;
}